ruby/rails/app/controllers/todos_controller.rb

  def index
    @todos = Todo.order("created_at DESC").all
---
SELECT "todos".* FROM "todos"  ORDER BY created_at DESC

  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "todo"], ["created_at", "2015-02-24 23:52:30.121094"], ["updated_at", "2015-02-24 23:52:30.121094"]]

  def update
    respond_to do |format|
      if @todo.update(todo_params)
---
UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", "t"], ["updated_at", "2015-03-13 12:22:51.160585"], ["id", 2]]

  def destroy
    @todo.destroy
---
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]

  def completed
    @todos = Todo.order("created_at DESC").where :completed => true
---
SELECT "todos".* FROM "todos" WHERE "todos"."completed" = 't'  ORDER BY created_at DESC

  def active
    @todos = Todo.order("created_at DESC").where :completed => false
---
SELECT "todos".* FROM "todos" WHERE "todos"."completed" = 'f'  ORDER BY created_at DESC

  def clear_completed
    todos = Todo.where :completed => true
    todos.each do |todo|
      todo.destroy
---
SELECT "todos".* FROM "todos" WHERE "todos"."completed" = 't'
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 2]]

    def set_todo
      @todo = Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 2]]